#### Задание 1
Скачайте с сайта https://grouplens.org/datasets/movielens/ датасет любого размера. Определите какому фильму было выставлено больше всего оценок 5.0.

In [2]:
import zipfile
import pandas as pd

In [15]:
z = zipfile.ZipFile('ml-25m.zip', 'r')

In [16]:
z.printdir()

File Name                                             Modified             Size
ml-25m/                                        2019-11-21 16:41:38            0
ml-25m/tags.csv                                2019-11-21 15:55:50     38810332
ml-25m/links.csv                               2019-11-21 16:40:20      1368578
ml-25m/README.txt                              2019-11-21 16:41:38        10460
ml-25m/ratings.csv                             2019-11-21 16:26:42    678260987
ml-25m/genome-tags.csv                         2019-11-21 16:35:38        18103
ml-25m/genome-scores.csv                       2019-11-21 16:35:38    435164157
ml-25m/movies.csv                              2019-11-21 16:32:10      3038099

In [17]:
z.extractall()

In [18]:
z.close()

In [19]:
df_movies = pd.read_csv('ml-25m/movies.csv')
df_movies.head()

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy

In [20]:
df_ratings = pd.read_csv('ml-25m/ratings.csv')
df_ratings.head()

   userId  movieId  rating   timestamp
0       1      296     5.0  1147880044
1       1      306     3.5  1147868817
2       1      307     5.0  1147868828
3       1      665     5.0  1147878820
4       1      899     3.5  1147868510

In [21]:
df_movies = df_movies.merge(df_ratings, how='left', on='movieId')
df_movies.head()

,movieId,title,genres,userId,rating,timestamp
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,2.0,3.5,1.141416e+09
1,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,3.0,4.0,1.439472e+09
2,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,4.0,3.0,1.573944e+09
3,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,5.0,4.0,8.586259e+08
4,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,8.0,4.0,8.904925e+08

In [6]:
df_movies.describe()

            movieId        userId        rating     timestamp
count  2.500347e+07  2.500010e+07  2.500010e+07  2.500010e+07
mean   2.140520e+04  8.118928e+04  3.533854e+00  1.215601e+09
std    3.922525e+04  4.679172e+04  1.060744e+00  2.268758e+08
min    1.000000e+00  1.000000e+00  5.000000e-01  7.896520e+08
25%    1.197000e+03  4.051000e+04  3.000000e+00  1.011747e+09
50%    2.947000e+03  8.091400e+04  3.500000e+00  1.198868e+09
75%    8.633000e+03  1.215570e+05  4.000000e+00  1.447205e+09
max    2.091710e+05  1.625410e+05  5.000000e+00  1.574328e+09

In [14]:
df_movies[df_movies['rating'] == 5.0].groupby('title').count().sort_values('movieId', ascending = False).head()

,movieId,genres,userId,rating,timestamp
title,,,,,
"Shawshank Redemption, The (1994)",39553,39553,39553,39553,39553
Pulp Fiction (1994),32169,32169,32169,32169,32169
Forrest Gump (1994),25918,25918,25918,25918,25918
Star Wars: Episode IV - A New Hope (1977),25804,25804,25804,25804,25804
"Matrix, The (1999)",25482,25482,25482,25482,25482

In [23]:
df_movies[df_movies['rating'] == 5.0]['title'].value_counts().head(5)

Shawshank Redemption, The (1994)             39553
Pulp Fiction (1994)                          32169
Forrest Gump (1994)                          25918
Star Wars: Episode IV - A New Hope (1977)    25804
Matrix, The (1999)                           25482
Name: title, dtype: int64

##### чуть чуть затупил, но решил оставить и то и то

In [24]:
del df_movies
del df_ratings

#### Задание 2
По данным файла power.csv посчитайте суммарное потребление стран Прибалтики (Латвия, Литва и Эстония) категорий 4, 12 и 21 за период с 2005 по 2010 года. Не учитывайте в расчетах отрицательные значения quantity.

In [87]:
df_power = pd.read_csv('power.csv')
df_power.head()

   country  year  quantity  category
0  Austria  1996       5.0         1
1  Austria  1995      17.0         1
2  Belgium  2014       0.0         1
3  Belgium  2013       0.0         1
4  Belgium  2012      35.0         1

In [88]:
df_power[df_power['country'].str.contains('lat', case = False)]['country'].unique()

array(['Latvia'], dtype=object)

In [89]:
df_power[df_power['country'].str.contains('lit', case = False)]['country'].unique()

array(['Lithuania'], dtype=object)

In [90]:
df_power[df_power['country'].str.contains('est', case = False)]['country'].unique()

array(['Estonia', 'State of Palestine', 'Timor-Leste'], dtype=object)

In [91]:
df_power.head()

   country  year  quantity  category
0  Austria  1996       5.0         1
1  Austria  1995      17.0         1
2  Belgium  2014       0.0         1
3  Belgium  2013       0.0         1
4  Belgium  2012      35.0         1

In [92]:
df_power_pribalt = df_power[(df_power['country'] == 'Latvia') | (df_power['country'] == 'Lithuania') | (df_power['country'] == 'Estonia')]

In [93]:
df_power_pribalt['country'].unique()

array(['Lithuania', 'Latvia', 'Estonia'], dtype=object)

In [94]:
df_power_pribalt_cat = df_power_pribalt[(df_power_pribalt['category'] == 4) | (df_power_pribalt['category'] == 12) | (df_power_pribalt['category'] == 21)]

In [96]:
df_power_pribalt_cat['year'].unique()

array([2008, 2007, 2006, 2005, 2004, 2003, 2002, 2001, 2000, 1999, 1998,
       1997, 1996, 1995, 1994, 1993, 1992, 2014, 2013, 2012, 2011, 2010,
       2009], dtype=int64)

In [97]:
df_power_pribalt_cat_y = df_power_pribalt_cat[(df_power_pribalt_cat['year'] >= 2005) & (df_power_pribalt_cat['year'] <= 2010)]

In [98]:
df_power_pribalt_cat_y['year'].unique()

array([2008, 2007, 2006, 2005, 2010, 2009], dtype=int64)

In [100]:
df_power_pribalt_cat_y[df_power_pribalt_cat_y['quantity'] > 0]['quantity'].sum()

240580.0

In [101]:
del df_power
del df_power_pribalt
del df_power_pribalt_cat
del df_power_pribalt_cat_y

##### Как сократить и написать более красиво в голову не пришло :(

#### Задание 3
Выберите страницу любого сайта с табличными данными. Импортируйте таблицы в pandas dataframe.
Примеры страниц (необязательно брать именно эти):
https://fortrader.org/quotes
www.finanz.ru...om-vremeni

In [84]:
df = pd.read_html('https://fortrader.org/quotes')

In [85]:
df[0]

                           Название   Цена  Изменение  Изменение(%)  Обновлено
0  EURRUB Курс евро к рублю сегодня  86.97       0.12          0.13        NaN
1       USDRUB Курс рубля к доллару  73.65       0.02          0.03        NaN

In [86]:
df[1]

,Название,Цена,Изменение,Изменение(%),Обновлено
0,Нефть Brent Курс нефти сегодня,73.58,-0.39,-0.53,NaN
1,Нефть WTI Цены на нефть WTI,71.88,-0.21,-0.29,NaN
2,Природный газ Цена на природный газ,3.92,-0.19,-4.51,NaN
3,Кофе,205.00,-2.95,-1.42,NaN
4,Кукуруза,549.00,-0.40,-0.07,NaN
5,Соя,357.80,3.80,1.07,NaN
6,Хлопок,90.23,0.63,0.70,NaN

#### не совсем понятно, что именно нужно в данном задании, если есть какие-то доп задания с удовольствием выполню для тренировки

##### p.s. В прошлом дз переназвал функцию sum, извиняюсь, поторопился))))

###### p.p.s. Не получилось подгрузить эксельники т.к. они больше 100 Мб, как решать такую проблему? по хорошему вы не сможете чекнуть дз, потому что данные брать не от куда как я понимаю, только глазами посмотреть код.